import starter
from timeit import default_timer

a = default_timer()
if __name__ == "__main__":
    code = ["повтор 7 раз:",
            "    разделить строку: строка='1 2 3 4 5', переменная=але",
            "    1awd = 123",
            "    если номер_повтора % 2:",
            "        добавить текст: текст=але, текст1=тип(номер_повтора)",
            "        сжать изображение: изображение=изображения[1], коэффициент=2",
            "        сжать изображение: изображение=изображения[2], коэффициент=2",
            '        если номер_повтора == 5:',
            '            отразить изображение: изображение=изображения[1], по_вертикали',
            "        наложить текст: куда=изображения[1], текст=строка(номер_повтора), где=левый_верхний_угол",
            "        наложить многоугольник: куда=изображения[1], углы=(левый_верхний_угол, (0.8, 0.1), (0.8, 0.2))",
            "        наложить прямоугольник: куда=изображения[1], где=(0.01, 0.01), ширина=0.98, высота=0.98, -",
            "- обводка=оранжевый",
            "        наложить линию: куда=изображения[1], точки=(левый_верхний_угол, левый_нижний_угол), цвет=жёлтый",
            "        наложить круг: куда=изображения[1], центр=правый_нижний_угол, радиус=0.1, цвет=жёлтый",
            "        наложить картинку: куда=изображения[1], где=по_центру, какую=изображения[2]",
            '        алё = копия(изображения[1])',
            '        если номер_повтора == 3:',
            '            наложить эффект: изображение=алё, блюр, серость',
            '        иначе если номер_повтора== 5:',
            '            a = print(тип(list("123")))',
            "        добавить изображение: изображение=алё"]
    starter.run_from_console(code=code, images=("test1.jpeg", "test2.png", "test3.png"))

print(default_timer() - a)
