# import base64
# import json
# from io import BytesIO
#
# from gaduka_engine import starter
# from timeit import default_timer
# from PIL import Image
#
#
# def test_console():
#     code = ['пример_списка = []',
#                 "повтор 7 раз:",
#                 "    разделить строку: строка='1 2 3 4 5', переменная=але",
#                 "    добавить элемент: список=пример_списка, элемент='элемент'",
#                 "    если номер_повтора % 2:",
#                 "        добавить текст: текст=але, текст1=тип(номер_повтора)",
#                 "        сжать изображение: изображение=изображения[1], коэффициент=2",
#                 "        сжать изображение: изображение=изображения[2], коэффициент=2",
#                 '        если номер_повтора == 5:',
#                 '            отразить изображение: изображение=изображения[1], по_вертикали',
#                 "        наложить текст: куда=изображения[1], текст=строка(номер_повтора), где=левый_верхний_угол",
#                 "        наложить многоугольник: куда=изображения[1], углы=(левый_верхний_угол, (0.8, 0.1), (0.8, 0.2))",
#                 "        наложить прямоугольник: куда=изображения[1], где=(0.01, 0.01), ширина=0.98, высота=0.98, -",
#                 "           - обводка=оранжевый",
#                 "        наложить линию: куда=изображения[1], точки=(левый_верхний_угол, левый_нижний_угол), цвет=жёлтый",
#                 "        наложить круг: куда=изображения[1], центр=правый_нижний_угол, радиус=0.1, цвет=жёлтый",
#                 "        наложить картинку: куда=изображения[1], где=по_центру, какую=изображения[2]",
#                 '        копия_изображения = копия(изображения[1])',
#                 '        если номер_повтора == 3:',
#                 '            наложить эффект: изображение=копия_изображения, блюр, серость',
#                 '        иначе если номер_повтора== 5:',
#                 '            повернуть изображение: изображение=копия_изображения, поворот=30',
#                 "        добавить изображение: изображение=копия_изображения",
#                 '    все элементы: список=пример_списка, переменная=результат',
#                 '    добавить текст: текст=результат',
#                 'счётчик = 10',
#                 "повтор пока счётчик > 1:",
#                 '    добавить текст: текст=("Сейчас счётчик показывает: " + строка(счётчик))',
#                 '    счётчик /= 2']
#     starter.run_from_console(code=code,
#                              images=["gaduka_engine/" + i for i in ("test1.jpeg", "test2.png", "test3.png")])
#
#
# def test_emulate_api():
#     code = ['пример_списка = []',
#             "повтор 7 раз:",
#             "    разделить строку: строка='1 2 3 4 5', переменная=але",
#             "    добавить элемент: список=пример_списка, элемент='элемент'",
#             "    если номер_повтора % 2:",
#             "        добавить текст: текст=але, текст1=тип(номер_повтора)",
#             "        сжать изображение: изображение=изображения[1], коэффициент=2",
#             "        сжать изображение: изображение=изображения[2], коэффициент=2",
#             '        если номер_повтора == 5:',
#             '            отразить изображение: изображение=изображения[1], по_вертикали',
#             "        наложить текст: куда=изображения[1], текст=строка(номер_повтора), где=левый_верхний_угол",
#             "        наложить многоугольник: куда=изображения[1], углы=(левый_верхний_угол, (0.8, 0.1), (0.8, 0.2))",
#             "        наложить прямоугольник: куда=изображения[1], где=(0.01, 0.01), ширина=0.98, высота=0.98, -",
#             "           - обводка=оранжевый",
#             "        наложить линию: куда=изображения[1], точки=(левый_верхний_угол, левый_нижний_угол), цвет=жёлтый",
#             "        наложить круг: куда=изображения[1], центр=правый_нижний_угол, радиус=0.1, цвет=жёлтый",
#             "        наложить картинку: куда=изображения[1], где=по_центру, какую=изображения[2]",
#             '        копия_изображения = копия(изображения[1])',
#             '        если номер_повтора == 3:',
#             '            наложить эффект: изображение=копия_изображения, блюр, серость',
#             '        иначе если номер_повтора== 5:',
#             '            повернуть изображение: изображение=копия_изображения, поворот=30',
#             "        добавить изображение: изображение=копия_изображения",
#             '    все элементы: список=пример_списка, переменная=результат',
#             '    добавить текст: текст=результат',
#             'счётчик = 10',
#             "повтор пока счётчик > 1:",
#             '    добавить текст: текст=("Сейчас счётчик показывает: " + строка(счётчик))',
#             '    счётчик /= 2']
#
#     a = []
#     for i in ["gaduka_engine/" + i for i in ("test1.jpeg", "test2.png", "test3.png")]:
#         i = Image.open(i)
#         buffered = BytesIO()
#         i.save(buffered, format="PNG")
#         img_byte = buffered.getvalue()
#         img_base64 = base64.b64encode(img_byte)
#         a.append(img_base64)
#         # a.append(json.dumps(i.tobytes().decode("latin1")))
#
#     a, b = starter.run_from_api(code=code, images_json=a)
#
#
# if __name__ == "__main__":
#     a = default_timer()
#     test_emulate_api()
#     print("Время выполнения:", default_timer() - a)

a = object()

import requests

print(requests.get(f'http://127.0.0.1/api/v1/users/1658246666').json())